MusicApp/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
---
  def new
    @album = Album.new
    @bands = Band.all

INSERT INTO "albums" ("title", "year", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "holla"], ["year", "8"], ["band_id", 2], ["created_at", "2018-09-13 23:56:11.112235"], ["updated_at", "2018-09-13 23:56:11.112235"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save!

SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @bands = Band.all
    @album = Album.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @album = Album.find(params[:id])
    @band = Band.find_by(id: @album.band_id)

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "band_id" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["band_id", 2], ["updated_at", "2018-09-14 00:09:56.058152"], ["id", 1]]
---
  def update
    @bands = Band.all
    @album = Album.find(params[:id])
    if @album.update(album_params)