MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "justice"], ["created_at", "2018-09-13 21:53:50.249774"], ["updated_at", "2018-09-13 21:53:50.249774"]]
---
  def create
    @band = Band.new(band_params)
    if @band.save!

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def destroy
    @band = Band.find(params[:id])
    if @band.destroy