MusicApp/app/models/user.rb

  def self.find_by_credentials(email, pass)
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user@user.com"], ["LIMIT", 1]]

  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ytUJBNOckN7t7EwVaMvJ-g"], ["updated_at", "2018-09-13 20:57:12.988644"], ["id", 4]]